export class TranslationSet {
    public language: string;
    public values: { [key: string]: string } = {};
  }

export const LanguageStrings: { [key: string]: TranslationSet} = {
    bg: {
        language: 'bg',
        values: {
                tabAboutLabel: 'За нас',
                tabGallery: 'Галерия',
                tabAboutBB: 'За продукта',
                tabMontessori: 'Монтесори',
                tabContacts: 'Контакти',
                contactUsText: 'Ако имате въпрос, искате да поръчате някое от нашите табла или имате идея за свое собствено,не се колебайте да се свържете с нас, с радост ще отговорим на всичките ви въпроси.',
                montessoriTextP1: 'Всеки родител мечтае детето му да развие своя потенциал, като същевременно се забавлява и расте спокойно и уверено в собствените си способности. В съвременната система на обучение и възпитание има редица методи, чрез които това може да бъде постигнато. Но има един по-нестандартен, който се отличава от останалите - методът Монтесори.',
                montessoriTextP2: 'Създателят на този интересен метод е д-р Мария Монтесори - италианска лекарка и световноизвестна педагожка. Тя извежда 19 принципа, които са водещи за успеха на метода Монтесори. Ние ще се спрем на първия, на който всъщност се основават нашите сензорни табла Busy Baby, а останалите може да прочетете ',
                montessoriLink: 'тук.',
                montessoriTextP3: '1. Децата се обучават с помощта на предмети от заобикалящия ги свят.',
                montessoriTextP4:'Децата взаимодействат със средата и са стимулирани от нея да се развиват. Те учат като пипат, усещат и манипулират всичко. Малките ръчички изследват, събират информация и имитират движенията на възрастните ръце. Работата с тях е в основата на разбирането на околния свят, взаимовръзките в него и подпомага развитието на мисленето и речта. Точно заради това много важни в Монтесори средата са заниманията, които развиват фината моторика. ',
                montessoriTextP5: 'Всеки човешки орган има проекция в полукълбата на главния мозък. Има дял, който отговаря за развитието на говора; има дял, отговарящ за движенията и те са разположени един до друг. Колкото по фини и сложни са движенията на  китките на ръцете, толкова по многообразни връзки се създадат в мозъка. И понеже тези зони са съседни, учните са доказали: развитието на финните движения на пръстите влияе директно върху развитието на говора. Развитието на говора спомага за развтието на мисленето. Мисленето и говорът от своя страна благоприятстват развитието на вниманието и паметта. Всичко е взаимоносвързано. Затова трябва да ангажираме детето по такъв начин, че да се упражняват китките на ръцете и да работят пръстите. Тук идват на помощ нашите сензорни табла - Busy Baby.',
                montessoriTextP6: 'Направени с елементи от бита, взаимствани от реалността, която е толкова интересна, а често пъти забранена за малките изследователи. Busy Baby задържа вниманието на децата, като им позволяват сами да избират кое им е интересно в момента. В различните етапи на развитието на детето различни елементи от таблото приковават неговото внимание, като най-често те избират това, за което се чувстват готови. Точно това прави Busy Baby подходяща за деца на възраст от 8-9 месеца до 3 години, а дори и повече.',
                montessoriTextP7: 'Таблото държи вниманието на децата, те се учат докато играят,а на родителите дава малко спокойни часове.'

        }
    },
    en: {
        language: 'en',
        values: {
            tabAboutLabel: 'About us',
            tabAboutBB: 'About Busy Baby',
            tabGallery: 'Gallery',
            tabMontessori: 'Montessori',
            tabContacts: 'Contacts',
            contactUsText: 'In case that you have a question, you would like to order any of or boards or have an idea for your own, customized board, do not hesitate to ocntact us. We would be glad to help you.'
        }
    }
};